_protected/frontend/controllers/SiteController.php

SELECT * FROM `news` WHERE (`status`='1') AND (`newtype`='1')
SELECT * FROM `news` WHERE (`status`='1') AND (`newtype`='2')
---
        ]);
         *
         */
        $news_type1 = News::find()->where(['status' => '1','newtype' => '1'])->all();
        $news_type2 = News::find()->where(['status' => '1','newtype' => '2'])->all();